Revit 2024 API
ContourSetting.RemoveItem Method
 Remove a contour setting item from the current contour setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public void RemoveItem(
	ContourSettingItem item
)
Visual Basic
Public Sub RemoveItem ( _
	item As ContourSettingItem _
)
Visual C++
public:
void RemoveItem(
	ContourSettingItem^ item
)
Parameters
item
Type: Autodesk.Revit.DB.ContourSettingItem
 The contour setting item to be removed.
Remarks
 Contour setting will not be changed if the item could not be found.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ContourSetting Class
Autodesk.Revit.DB Namespace